## Terraform Plan Output - sim - hub
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.hub.azurerm_firewall_policy.fwpolicy will be created
  + resource "azurerm_firewall_policy" "fwpolicy" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "allow-internal-afwp"
      + resource_group_name      = "dbdemo-sim-hub-eastus-afwp"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Standard"
      + tags                     = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "role"        = "hub_base_firewall_policy"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
      + threat_intelligence_mode = "Alert"
    }

  # module.hub.azurerm_firewall_policy_rule_collection_group.allow_internal will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "allow_internal" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-internal-fwprcg"
      + priority           = 100

      + network_rule_collection {
          + action   = "Allow"
          + name     = "allow-internal-fwnetrc"
          + priority = 100

          + rule {
              + destination_addresses = [
                  + "10.0.0.0/8",
                  + "172.16.0.0/12",
                  + "192.168.0.0/16",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "rfc1918"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.0.0.0/8",
                  + "172.16.0.0/12",
                  + "192.168.0.0/16",
                ]
            }
        }
    }

  # module.hub.azurerm_public_ip_prefix.bastion["eastus"] will be created
  + resource "azurerm_public_ip_prefix" "bastion" {
      + id                  = (known after apply)
      + ip_prefix           = (known after apply)
      + ip_version          = "IPv4"
      + location            = "eastus"
      + name                = "dbdemo-sim-pips-eastus-pippf"
      + prefix_length       = 31
      + resource_group_name = "dbdemo-sim-pips-eastus-rg"
      + sku                 = "Standard"
      + tags                = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "role"        = "hub_bastion_public_ip_prefix"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
    }

  # module.hub.azurerm_public_ip_prefix.bastion["eastus2"] will be created
  + resource "azurerm_public_ip_prefix" "bastion" {
      + id                  = (known after apply)
      + ip_prefix           = (known after apply)
      + ip_version          = "IPv4"
      + location            = "eastus2"
      + name                = "dbdemo-sim-pips-eastus2-pippf"
      + prefix_length       = 31
      + resource_group_name = "dbdemo-sim-pips-eastus2-rg"
      + sku                 = "Standard"
      + tags                = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "role"        = "hub_bastion_public_ip_prefix"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
    }

  # module.hub.azurerm_resource_group.fwpolicy will be created
  + resource "azurerm_resource_group" "fwpolicy" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "dbdemo-sim-hub-eastus-afwp"
      + tags     = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
    }

  # module.hub.azurerm_resource_group.hub["eastus"] will be created
  + resource "azurerm_resource_group" "hub" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "dbdemo-sim-hub-eastus-rg"
      + tags     = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
    }

  # module.hub.azurerm_resource_group.hub["eastus2"] will be created
  + resource "azurerm_resource_group" "hub" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "dbdemo-sim-hub-eastus2-rg"
      + tags     = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
    }

  # module.hub.azurerm_resource_group.private_dns will be created
  + resource "azurerm_resource_group" "private_dns" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "dbdemo-sim-private-dns-eastus-rg"
      + tags     = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
    }

  # module.hub.azurerm_resource_group.public_ips["eastus"] will be created
  + resource "azurerm_resource_group" "public_ips" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "dbdemo-sim-pips-eastus-rg"
      + tags     = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
    }

  # module.hub.azurerm_resource_group.public_ips["eastus2"] will be created
  + resource "azurerm_resource_group" "public_ips" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "dbdemo-sim-pips-eastus2-rg"
      + tags     = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
    }

  # module.hub.module.hubnetworks.azurerm_route_table.hub_routing["eastus"] will be created
  + resource "azurerm_route_table" "hub_routing" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "route-eastus"
      + resource_group_name           = "dbdemo-sim-hub-eastus-rg"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/0"
              + name                   = "internet"
              + next_hop_in_ip_address = ""
              + next_hop_type          = "Internet"
            },
          + {
              + address_prefix         = "10.2.0.0/16"
              + name                   = "eastus2-10.2.0.0-16"
              + next_hop_in_ip_address = "1.2.3.4"
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_route_table.hub_routing["eastus2"] will be created
  + resource "azurerm_route_table" "hub_routing" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "eastus2"
      + name                          = "route-eastus2"
      + resource_group_name           = "dbdemo-sim-hub-eastus2-rg"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/0"
              + name                   = "internet"
              + next_hop_in_ip_address = ""
              + next_hop_type          = "Internet"
            },
          + {
              + address_prefix         = "10.1.0.0/16"
              + name                   = "eastus-10.1.0.0-16"
              + next_hop_in_ip_address = "1.2.3.4"
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-ServiceNowVMs"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-ServiceNowVMs"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_virtual_network_peering.hub_peering["dbdemo-sim-hub-eastus-fw-dbdemo-sim-hub-eastus2-fw"] will be created
  + resource "azurerm_virtual_network_peering" "hub_peering" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "dbdemo-sim-hub-eastus-fw-dbdemo-sim-hub-eastus2-fw"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "dbdemo-sim-hub-eastus-rg"
      + use_remote_gateways          = false
      + virtual_network_name         = "dbdemo-sim-hub-eastus-fw"
    }

  # module.hub.module.hubnetworks.azurerm_virtual_network_peering.hub_peering["dbdemo-sim-hub-eastus2-fw-dbdemo-sim-hub-eastus-fw"] will be created
  + resource "azurerm_virtual_network_peering" "hub_peering" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "dbdemo-sim-hub-eastus2-fw-dbdemo-sim-hub-eastus-fw"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "dbdemo-sim-hub-eastus2-rg"
      + use_remote_gateways          = false
      + virtual_network_name         = "dbdemo-sim-hub-eastus2-fw"
    }

  # module.hub.module.naming["eastus"].random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hub.module.naming["eastus"].random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hub.module.naming["eastus2"].random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hub.module.naming["eastus2"].random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hub.module.naming_firewall_policy.random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hub.module.naming_firewall_policy.random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hub.module.naming_private_dns.random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hub.module.naming_private_dns.random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hub.module.naming_public_ips["eastus"].random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hub.module.naming_public_ips["eastus"].random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hub.module.naming_public_ips["eastus2"].random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hub.module.naming_public_ips["eastus2"].random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hub.module.private_dns_zones["privatelink.blob.core.windows.net"].azurerm_private_dns_zone.privatednszone will be created
  + resource "azurerm_private_dns_zone" "privatednszone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dbdemo-sim-private-dns-eastus-rg"
      + tags                                                  = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
    }

  # module.hub.module.private_dns_zones["privatelink.blob.core.windows.net"].azurerm_private_dns_zone_virtual_network_link.vnetlink[0] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnetlink" {
      + id                    = (known after apply)
      + name                  = "privatelink.blob.core.windows.net0"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dbdemo-sim-private-dns-eastus-rg"
      + tags                  = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.hub.module.private_dns_zones["privatelink.blob.core.windows.net"].azurerm_private_dns_zone_virtual_network_link.vnetlink[1] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnetlink" {
      + id                    = (known after apply)
      + name                  = "privatelink.blob.core.windows.net1"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dbdemo-sim-private-dns-eastus-rg"
      + tags                  = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_subnet.subnet["AzureBastionSubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.1.0.64/26",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-sim-hub-eastus-rg"
      + virtual_network_name                           = "dbdemo-sim-hub-eastus-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_subnet.subnet["ServiceNowVMs"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.1.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ServiceNowVMs"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-sim-hub-eastus-rg"
      + virtual_network_name                           = "dbdemo-sim-hub-eastus-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space           = [
          + "10.1.0.0/16",
        ]
      + dns_servers             = (known after apply)
      + flow_timeout_in_minutes = 4
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = "eastus"
      + name                    = "dbdemo-sim-hub-eastus-fw"
      + resource_group_name     = "dbdemo-sim-hub-eastus-rg"
      + subnet                  = (known after apply)
      + tags                    = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "role"        = "hub_virtual_network"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["AzureBastionSubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.2.0.64/26",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-sim-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-sim-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["ServiceNowVMs"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.2.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ServiceNowVMs"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-sim-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-sim-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space           = [
          + "10.2.0.0/16",
        ]
      + dns_servers             = (known after apply)
      + flow_timeout_in_minutes = 4
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = "eastus2"
      + name                    = "dbdemo-sim-hub-eastus2-fw"
      + resource_group_name     = "dbdemo-sim-hub-eastus2-rg"
      + subnet                  = (known after apply)
      + tags                    = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "role"        = "hub_virtual_network"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
    }

Plan: 37 to add, 0 to change, 0 to destroy.
```
</details>